app/concepts/auth/operation/login.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test3@example.com' LIMIT 1
---
    def find_user(ctx, params:, **)
      user = User.find_by(email: params[:email])