app/concepts/auth/operation/register.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1
---
    def check_email_uniqueness(ctx, params:, **)
      if User.exists?(email: params[:email])

INSERT INTO "users" ("id", "name", "email", "password_digest", "phone", "role", "avatar", "reset_password_token", "reset_password_sent_at", "created_at", "updated_at") VALUES ('a78b4aef-61e6-4fd8-8a3a-9e2dfc36d8d6', 'test', 'test@example.com', '$2a$12$6etjfArx81tLFvwEurNA/O1kTBpp3wSpwbJPnU61a.NMQhSXhWllC', '+573150450505', 'admin', NULL, NULL, NULL, '2025-07-31 13:53:27.627838', '2025-07-31 13:53:27.627838') RETURNING "id"
---
    def create_user(ctx, params:, **)
      user_params = params.except(:confirm_password, :confirmPassword)
      user = User.new(user_params)

      if user.save